## Terraform Plans 🌍

<details>
<summary><b>DEV</b> Environment</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.entra_groups.azuread_group.core_contributors: Refreshing state... [id=d0be0ca6-dc84-4456-ae00-3371041a0718]
module.entra_groups.azuread_group.core_admins: Refreshing state... [id=5e13ce56-d9e6-49ce-97cd-ba56ef98f960]
module.core_workspace.fabric_workspace.core: Refreshing state... [id=c21f9a54-1f19-4211-91b6-2091d56109c7]
module.core_workspace.fabric_workspace_role_assignment.admin: Refreshing state... [id=5e13ce56-d9e6-49ce-97cd-ba56ef98f960]
module.core_workspace.fabric_warehouse.core: Refreshing state... [id=afceb142-24f0-4029-8cd0-2c4fb6420f3f]
module.core_workspace.fabric_lakehouse.core: Refreshing state... [id=e2fc95a2-e329-4e23-946b-20479200ad12]
module.core_workspace.fabric_workspace_role_assignment.contributor: Refreshing state... [id=d0be0ca6-dc84-4456-ae00-3371041a0718]
module.core_workspace.terraform_data.warehouse_schemas: Refreshing state... [id=0515ab23-bd2b-0804-5b6f-066facb3bfca]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fabric_domain.core will be created
  + resource "fabric_domain" "core" {
      + contributors_scope = (known after apply)
      + description        = "Core domain containing platform workspaces for all environments"
      + display_name       = "Core"
      + id                 = (known after apply)
      + parent_domain_id   = (known after apply)
    }

  # fabric_domain.platform will be created
  + resource "fabric_domain" "platform" {
      + contributors_scope = "AdminsOnly"
      + description        = "Root domain for the Fabric data platform"
      + display_name       = "Data Platform"
      + id                 = (known after apply)
    }

  # fabric_domain_workspace_assignments.core will be created
  + resource "fabric_domain_workspace_assignments" "core" {
      + domain_id     = (known after apply)
      + workspace_ids = [
          + "c21f9a54-1f19-4211-91b6-2091d56109c7",
        ]
    }

  # module.core_workspace.fabric_variable_library.deployment will be created
  + resource "fabric_variable_library" "deployment" {
      + definition                = {
          + "settings.json" = {
              + processing_mode       = "GoTemplate"
              + source                = "modules/core-workspace/definitions/settings.json"
              + source_content_sha256 = "59b2bc75a65405a4369b9efd26670ded6533a5658f9d0608a4289ac8dd848f0c"
              + tokens_delimiter      = "{{}}"
            },
          + "variables.json" = {
              + processing_mode       = "GoTemplate"
              + source                = "modules/core-workspace/definitions/variables.json"
              + source_content_sha256 = "d9448597ab154c86c1ad6022252708ab8b0b71b21a91e4051ca76e33177e95b3"
              + tokens                = {
                  + "capacity_id"    = "01CA0BA8-FCEE-4FB2-A296-C131D0DEC5B6"
                  + "environment"    = "dev"
                  + "lakehouse_id"   = "e2fc95a2-e329-4e23-946b-20479200ad12"
                  + "lakehouse_name" = "core_lakehouse_dev"
                  + "warehouse_id"   = "afceb142-24f0-4029-8cd0-2c4fb6420f3f"
                  + "warehouse_name" = "core_warehouse_dev"
                  + "workspace_id"   = "c21f9a54-1f19-4211-91b6-2091d56109c7"
                  + "workspace_name" = "fabric-core-dev"
                }
              + tokens_delimiter      = "{{}}"
            },
        }
      + definition_update_enabled = true
      + description               = "Variable library for Fabric deployment pipelines - Dev environment"
      + display_name              = "deployment_variables_dev"
      + format                    = "Default"
      + id                        = (known after apply)
      + properties                = (known after apply)
      + workspace_id              = "c21f9a54-1f19-4211-91b6-2091d56109c7"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + business_domain_ids      = {}
  + core_domain_id           = (known after apply)
  + core_variable_library_id = (known after apply)
  + core_workspace_id        = "c21f9a54-1f19-4211-91b6-2091d56109c7"
  + core_workspace_name      = "fabric-core-dev"
  + domain_workspace_ids     = {}
  + domain_workspace_names   = {}
  + platform_domain_id       = (known after apply)

Warning: 'Domain' preview mode

  with fabric_domain.platform,
  on main.tf line 22, in resource "fabric_domain" "platform":
  22: resource "fabric_domain" "platform" {

The 'Domain' behavior may change in future releases without notice or
compatibility guarantees.

(and 3 more similar warnings elsewhere)

Warning: 'Domain Workspace Assignment' preview mode

  with fabric_domain_workspace_assignments.core,
  on main.tf line 81, in resource "fabric_domain_workspace_assignments" "core":
  81: resource "fabric_domain_workspace_assignments" "core" {

The 'Domain Workspace Assignment' behavior may change in future releases
without notice or compatibility guarantees.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>

<details>
<summary><b>TEST</b> Environment</summary>

```terraform
module.entra_groups.azuread_group.core_contributors: Refreshing state... [id=fc0753e8-564f-4b04-9fa5-60866b5f55c4]
module.entra_groups.azuread_group.core_admins: Refreshing state... [id=0489ecfe-5a36-4984-be0d-a9a54fa036a8]
module.core_workspace.fabric_workspace.core: Refreshing state... [id=b7cfa3fa-c348-4ccd-936b-97499ee4b92f]
module.core_workspace.fabric_workspace_role_assignment.admin: Refreshing state... [id=0489ecfe-5a36-4984-be0d-a9a54fa036a8]
module.core_workspace.fabric_warehouse.core: Refreshing state... [id=cbb3be52-ff9d-437d-a3d7-b09c2d25c25e]
module.core_workspace.fabric_lakehouse.core: Refreshing state... [id=8b54a61e-288a-4de1-86d0-45ac46125c98]
module.core_workspace.fabric_workspace_role_assignment.contributor: Refreshing state... [id=fc0753e8-564f-4b04-9fa5-60866b5f55c4]
module.core_workspace.terraform_data.warehouse_schemas: Refreshing state... [id=ff0154f5-c9a9-c1f0-4c0f-25886cbecbc9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fabric_domain.core will be created
  + resource "fabric_domain" "core" {
      + contributors_scope = (known after apply)
      + description        = "Core domain containing platform workspaces for all environments"
      + display_name       = "Core"
      + id                 = (known after apply)
      + parent_domain_id   = (known after apply)
    }

  # fabric_domain.platform will be created
  + resource "fabric_domain" "platform" {
      + contributors_scope = "AdminsOnly"
      + description        = "Root domain for the Fabric data platform"
      + display_name       = "Data Platform"
      + id                 = (known after apply)
    }

  # fabric_domain_workspace_assignments.core will be created
  + resource "fabric_domain_workspace_assignments" "core" {
      + domain_id     = (known after apply)
      + workspace_ids = [
          + "b7cfa3fa-c348-4ccd-936b-97499ee4b92f",
        ]
    }

  # module.core_workspace.fabric_variable_library.deployment will be created
  + resource "fabric_variable_library" "deployment" {
      + definition                = {
          + "settings.json" = {
              + processing_mode       = "GoTemplate"
              + source                = "modules/core-workspace/definitions/settings.json"
              + source_content_sha256 = "59b2bc75a65405a4369b9efd26670ded6533a5658f9d0608a4289ac8dd848f0c"
              + tokens_delimiter      = "{{}}"
            },
          + "variables.json" = {
              + processing_mode       = "GoTemplate"
              + source                = "modules/core-workspace/definitions/variables.json"
              + source_content_sha256 = "6aebea7e8460f271f00ac36e4799c7bb9948ed0f1eec9e714993478a423b80d0"
              + tokens                = {
                  + "capacity_id"    = "01CA0BA8-FCEE-4FB2-A296-C131D0DEC5B6"
                  + "environment"    = "test"
                  + "lakehouse_id"   = "8b54a61e-288a-4de1-86d0-45ac46125c98"
                  + "lakehouse_name" = "core_lakehouse_test"
                  + "warehouse_id"   = "cbb3be52-ff9d-437d-a3d7-b09c2d25c25e"
                  + "warehouse_name" = "core_warehouse_test"
                  + "workspace_id"   = "b7cfa3fa-c348-4ccd-936b-97499ee4b92f"
                  + "workspace_name" = "fabric-core-test"
                }
              + tokens_delimiter      = "{{}}"
            },
        }
      + definition_update_enabled = true
      + description               = "Variable library for Fabric deployment pipelines - Test environment"
      + display_name              = "deployment_variables_test"
      + format                    = "Default"
      + id                        = (known after apply)
      + properties                = (known after apply)
      + workspace_id              = "b7cfa3fa-c348-4ccd-936b-97499ee4b92f"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + business_domain_ids      = {}
  + core_domain_id           = (known after apply)
  + core_variable_library_id = (known after apply)
  + core_workspace_id        = "b7cfa3fa-c348-4ccd-936b-97499ee4b92f"
  + core_workspace_name      = "fabric-core-test"
  + domain_workspace_ids     = {}
  + domain_workspace_names   = {}
  + platform_domain_id       = (known after apply)

Warning: 'Domain' preview mode

  with fabric_domain.platform,
  on main.tf line 22, in resource "fabric_domain" "platform":
  22: resource "fabric_domain" "platform" {

The 'Domain' behavior may change in future releases without notice or
compatibility guarantees.

(and 3 more similar warnings elsewhere)

Warning: 'Domain Workspace Assignment' preview mode

  with fabric_domain_workspace_assignments.core,
  on main.tf line 81, in resource "fabric_domain_workspace_assignments" "core":
  81: resource "fabric_domain_workspace_assignments" "core" {

The 'Domain Workspace Assignment' behavior may change in future releases
without notice or compatibility guarantees.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

<details>
<summary><b>PROD</b> Environment</summary>

```terraform
module.entra_groups.azuread_group.core_admins: Refreshing state... [id=d44ab011-11e8-46fd-9eaf-3285880f1418]
module.entra_groups.azuread_group.business_contributors["sales"]: Refreshing state... [id=46689092-dbcb-4fb3-950a-db84eb8bfe08]
module.entra_groups.azuread_group.app_viewers_org[0]: Refreshing state... [id=3869c8f4-4f83-496a-a6cf-29a8683acb1f]
module.entra_groups.azuread_group.business_contributors["finance"]: Refreshing state... [id=f3a6dce2-b184-4f11-822e-286b7692a683]
module.entra_groups.azuread_group.app_viewers_domain["sales"]: Refreshing state... [id=e2439107-bf7d-481a-990f-32436a7d2e9b]
module.entra_groups.azuread_group.business_contributors["marketing"]: Refreshing state... [id=75481737-469d-42d4-835d-1e315d2ab38d]
module.entra_groups.azuread_group.app_viewers_domain["finance"]: Refreshing state... [id=0f6f067c-b5ed-4928-87bd-a16eb8d0c15c]
module.entra_groups.azuread_group.platform_admins[0]: Refreshing state... [id=0b5109fd-464e-4477-8212-f4b9ac52c887]
module.entra_groups.azuread_group.app_viewers_domain["marketing"]: Refreshing state... [id=f5cd6ec7-7fef-4a49-801c-bebd3a69f75c]
module.entra_groups.azuread_group.business_admins["sales"]: Refreshing state... [id=fc2e2fae-f38b-4dde-a513-4861f25214a1]
module.entra_groups.azuread_group.core_contributors: Refreshing state... [id=48410d02-281d-4f96-852e-1d1b2a0d5920]
module.entra_groups.azuread_group.cicd_approvers[0]: Refreshing state... [id=b897f037-a875-40b3-8554-a558fb6cb3d4]
module.entra_groups.azuread_group.business_admins["finance"]: Refreshing state... [id=249ad63d-5996-4266-9e61-2613abbdeceb]
module.entra_groups.azuread_group.business_admins["marketing"]: Refreshing state... [id=d631c014-5ae1-4534-acce-3e6b7934c9b9]
module.core_workspace.fabric_workspace.core: Refreshing state... [id=7c3dc78e-2712-4cf4-bf31-286bbe90283c]
module.core_workspace.fabric_workspace_role_assignment.admin: Refreshing state... [id=d44ab011-11e8-46fd-9eaf-3285880f1418]
module.core_workspace.fabric_lakehouse.core: Refreshing state... [id=ec9d3729-8d74-4d46-90f1-699818a13001]
module.core_workspace.fabric_warehouse.core: Refreshing state... [id=583d0e17-9c9e-4de0-960d-7348f0738163]
module.core_workspace.fabric_workspace_role_assignment.contributor: Refreshing state... [id=48410d02-281d-4f96-852e-1d1b2a0d5920]
module.core_workspace.terraform_data.warehouse_schemas: Refreshing state... [id=7a70496b-0617-026d-c2af-38122e3e694e]
module.domain_workspace["finance"].fabric_workspace.domain: Refreshing state... [id=bd448957-7648-49b4-898f-590c25a7aeda]
module.domain_workspace["sales"].fabric_workspace.domain: Refreshing state... [id=40abbb8e-5e94-4ad8-9c0c-f08e9beac347]
module.domain_workspace["marketing"].fabric_workspace.domain: Refreshing state... [id=8250dc37-48d8-4cb2-a9b3-9a8a5cabb9b0]
module.domain_workspace["finance"].fabric_workspace_role_assignment.admin: Refreshing state... [id=0b5109fd-464e-4477-8212-f4b9ac52c887]
module.domain_workspace["sales"].fabric_workspace_role_assignment.admin: Refreshing state... [id=0b5109fd-464e-4477-8212-f4b9ac52c887]
module.domain_workspace["marketing"].fabric_workspace_role_assignment.admin: Refreshing state... [id=0b5109fd-464e-4477-8212-f4b9ac52c887]
module.domain_workspace["finance"].fabric_lakehouse.domain: Refreshing state... [id=9e3fcb84-217f-4c73-9efe-6420439c2014]
module.domain_workspace["marketing"].fabric_lakehouse.domain: Refreshing state... [id=43e74143-0821-4f5d-a1c5-731bd199d39d]
module.domain_workspace["sales"].fabric_lakehouse.domain: Refreshing state... [id=75cd2285-b641-4733-aae8-85da19c25499]
module.domain_workspace["sales"].fabric_shortcut.warehouse_gold: Refreshing state... [id=40abbb8e-5e94-4ad8-9c0c-f08e9beac34775cd2285-b641-4733-aae8-85da19c25499Tablescore_warehouse_gold]
module.domain_workspace["finance"].fabric_shortcut.warehouse_gold: Refreshing state... [id=bd448957-7648-49b4-898f-590c25a7aeda9e3fcb84-217f-4c73-9efe-6420439c2014Tablescore_warehouse_gold]
module.domain_workspace["marketing"].fabric_shortcut.warehouse_gold: Refreshing state... [id=8250dc37-48d8-4cb2-a9b3-9a8a5cabb9b043e74143-0821-4f5d-a1c5-731bd199d39dTablescore_warehouse_gold]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fabric_domain.business["finance"] will be created
  + resource "fabric_domain" "business" {
      + contributors_scope = (known after apply)
      + description        = "Finance domain for business-specific data products"
      + display_name       = "Finance"
      + id                 = (known after apply)
      + parent_domain_id   = (known after apply)
    }

  # fabric_domain.business["marketing"] will be created
  + resource "fabric_domain" "business" {
      + contributors_scope = (known after apply)
      + description        = "Marketing domain for business-specific data products"
      + display_name       = "Marketing"
      + id                 = (known after apply)
      + parent_domain_id   = (known after apply)
    }

  # fabric_domain.business["sales"] will be created
  + resource "fabric_domain" "business" {
      + contributors_scope = (known after apply)
      + description        = "Sales domain for business-specific data products"
      + display_name       = "Sales"
      + id                 = (known after apply)
      + parent_domain_id   = (known after apply)
    }

  # fabric_domain.core will be created
  + resource "fabric_domain" "core" {
      + contributors_scope = (known after apply)
      + description        = "Core domain containing platform workspaces for all environments"
      + display_name       = "Core"
      + id                 = (known after apply)
      + parent_domain_id   = (known after apply)
    }

  # fabric_domain.platform will be created
  + resource "fabric_domain" "platform" {
      + contributors_scope = "AdminsOnly"
      + description        = "Root domain for the Fabric data platform"
      + display_name       = "Data Platform"
      + id                 = (known after apply)
    }

  # fabric_domain_workspace_assignments.business["finance"] will be created
  + resource "fabric_domain_workspace_assignments" "business" {
      + domain_id     = (known after apply)
      + workspace_ids = [
          + "bd448957-7648-49b4-898f-590c25a7aeda",
        ]
    }

  # fabric_domain_workspace_assignments.business["marketing"] will be created
  + resource "fabric_domain_workspace_assignments" "business" {
      + domain_id     = (known after apply)
      + workspace_ids = [
          + "8250dc37-48d8-4cb2-a9b3-9a8a5cabb9b0",
        ]
    }

  # fabric_domain_workspace_assignments.business["sales"] will be created
  + resource "fabric_domain_workspace_assignments" "business" {
      + domain_id     = (known after apply)
      + workspace_ids = [
          + "40abbb8e-5e94-4ad8-9c0c-f08e9beac347",
        ]
    }

  # fabric_domain_workspace_assignments.core will be created
  + resource "fabric_domain_workspace_assignments" "core" {
      + domain_id     = (known after apply)
      + workspace_ids = [
          + "7c3dc78e-2712-4cf4-bf31-286bbe90283c",
        ]
    }

  # module.core_workspace.fabric_variable_library.deployment will be created
  + resource "fabric_variable_library" "deployment" {
      + definition                = {
          + "settings.json" = {
              + processing_mode       = "GoTemplate"
              + source                = "modules/core-workspace/definitions/settings.json"
              + source_content_sha256 = "59b2bc75a65405a4369b9efd26670ded6533a5658f9d0608a4289ac8dd848f0c"
              + tokens_delimiter      = "{{}}"
            },
          + "variables.json" = {
              + processing_mode       = "GoTemplate"
              + source                = "modules/core-workspace/definitions/variables.json"
              + source_content_sha256 = "47fe064bbc73384fe68ea6b7c980948ccd9a2e372bb9b0c90ab118b9e572d942"
              + tokens                = {
                  + "capacity_id"    = "01CA0BA8-FCEE-4FB2-A296-C131D0DEC5B6"
                  + "environment"    = "prod"
                  + "lakehouse_id"   = "ec9d3729-8d74-4d46-90f1-699818a13001"
                  + "lakehouse_name" = "core_lakehouse_prod"
                  + "warehouse_id"   = "583d0e17-9c9e-4de0-960d-7348f0738163"
                  + "warehouse_name" = "core_warehouse_prod"
                  + "workspace_id"   = "7c3dc78e-2712-4cf4-bf31-286bbe90283c"
                  + "workspace_name" = "fabric-core-prod"
                }
              + tokens_delimiter      = "{{}}"
            },
        }
      + definition_update_enabled = true
      + description               = "Variable library for Fabric deployment pipelines - Prod environment"
      + display_name              = "deployment_variables_prod"
      + format                    = "Default"
      + id                        = (known after apply)
      + properties                = (known after apply)
      + workspace_id              = "7c3dc78e-2712-4cf4-bf31-286bbe90283c"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + business_domain_ids      = {
      + finance   = (known after apply)
      + marketing = (known after apply)
      + sales     = (known after apply)
    }
  + core_domain_id           = (known after apply)
  + core_variable_library_id = (known after apply)
  + core_workspace_id        = "7c3dc78e-2712-4cf4-bf31-286bbe90283c"
  + core_workspace_name      = "fabric-core-prod"
  + domain_workspace_ids     = {
      + finance   = "bd448957-7648-49b4-898f-590c25a7aeda"
      + marketing = "8250dc37-48d8-4cb2-a9b3-9a8a5cabb9b0"
      + sales     = "40abbb8e-5e94-4ad8-9c0c-f08e9beac347"
    }
  + domain_workspace_names   = {
      + finance   = "fabric-finance-prod"
      + marketing = "fabric-marketing-prod"
      + sales     = "fabric-sales-prod"
    }
  + platform_domain_id       = (known after apply)

Warning: 'Domain' preview mode

  with fabric_domain.platform,
  on main.tf line 22, in resource "fabric_domain" "platform":
  22: resource "fabric_domain" "platform" {

The 'Domain' behavior may change in future releases without notice or
compatibility guarantees.

(and 9 more similar warnings elsewhere)

Warning: 'Domain Workspace Assignment' preview mode

  with fabric_domain_workspace_assignments.core,
  on main.tf line 81, in resource "fabric_domain_workspace_assignments" "core":
  81: resource "fabric_domain_workspace_assignments" "core" {

The 'Domain Workspace Assignment' behavior may change in future releases
without notice or compatibility guarantees.

(and 7 more similar warnings elsewhere)

Warning: 'Shortcut' preview mode

  with module.domain_workspace["sales"].fabric_shortcut.warehouse_gold,
  on modules/domain-workspace/main.tf line 28, in resource "fabric_shortcut" "warehouse_gold":
  28: resource "fabric_shortcut" "warehouse_gold" {

The 'Shortcut' behavior may change in future releases without notice or
compatibility guarantees.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

